Revit 2027 API
ParameterTypeId.StairsRuntypeTotalDepth Property
 "Total Depth": Total Depth
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRuntypeTotalDepth { get; }
Public Shared ReadOnly Property StairsRuntypeTotalDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRuntypeTotalDepth {
	ForgeTypeId^ get ();
}
static member StairsRuntypeTotalDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace